[WalkerServos X2EquipmentTemplate]
FriendlyName="Microstim Implant"
FriendlyNamePlural="Microstim Implants"
BriefSummary="The Mech autopsy has enabled us to create a miniaturized stim delivery system. The most immediate application are electronic implants that can be non-surgically attached to limbs to provide short bursts of electro-chemical stimulation right to muscle tissue. In practical terms, this will provide our operatives with focused bursts of strength that translate into brief but radical gains in speed, agility, and jumping prowess"
TacticalText="<Bullet/>Microstim Implants grant +3 mobility, +10 dodge and the ability to jump on buildings."
